In [1]:
import pandas as pd
df = pd.DataFrame({'Name': {0: '김딴짓', 1: '박분기', 2: '이퇴근'},
                   '수학': {0: 90, 1: 93, 2: 85},
                   '영어': {0: 92, 1: 84, 2: 86},
                   '국어': {0: 91, 1: 94, 2: 83},})

df

  Name  수학  영어  국어
0  김딴짓  90  92  91
1  박분기  93  84  94
2  이퇴근  85  86  83

In [2]:
df = pd.melt(df, id_vars=['Name'])

df.head()

  Name variable  value
0  김딴짓       수학     90
1  박분기       수학     93
2  이퇴근       수학     85
3  김딴짓       영어     92
4  박분기       영어     84

In [3]:
df = df.sort_values(by='value', ascending=False)
print(sum(df['value'].iloc[:5]))

460